lahaan/nrf52dk-aw/src/main.c
/*

v1.3-121125LPE-s3
    -cloudfare DoS issue mentioned at ln1300
HTTPS POLLING SIM7080-NRF52832DK
    Works via setting up networking (APN), then HTTPS session w/ certs
    Polls server every 10s for commands; polling 7<= can cause brownouts (currently close to pin 2x 220uF, 1x 100nF, 1x 10uF & away 5x 220uF extra)
    Backend sends NOCMD if no commands pending
    1-2s (or at least 800ms) delay before AT+SHREAD (after SHREQ) is critical to avoid CME ERROR 3

    Modem PWRKEY & interrupt pin from SBC not added yet (todo) + cleanup needed to do (unndeed includes/defines, comments, code etc)
    More notes:
     *Initial setup can be sped up
     *Debug prints & delays can be removed &or reduced
     *Cert doesn't have to be sent everytime (could be in main / everytime the modem boots, perhaps implement w/ PWRKEY pin logic)

     v1.1-201025 - added SBC modem handoff to MCU x PSM&eDRX states x updated dts [psm/edrx unused, not implemented in backend yet]
     **v1.1-241025a - additional handoff logic - tested working (no button logic yet) MCU-SBC-MCU handoff cycle OK via systemctl suspend/HTTPS wake
     v1.1-241025b - handoff that "works" MCU-SBC-MCU handoff (60-90% reliable suspend/HTTPS wake) + button handoff (50-80% reliable) idek
            Note: sometimes dies, sometimes modem starts speaking chinese (nihao!)
        241025a-R - refactoring (starting w stable 241025a version not 241025b); R2 - fixed + tested
     *v1.1-271025 - Merged 241025a-R2 & 241025b - Works reliably. Tested. [Demo-ready / PoC-ready]
            Note: when SBC is active for a while, and MCU takes back control, MCU/Modem run into @cloudflare issue, mistakenly think HTTPS conn successful
     v1.1-271025a - Added PWRKEY functionality, recovery, logging states
     v1.1-291025 - Watchdog reset on nrf stuck state -- low power functionality for nrf
     v1.2-311025 - WDT+PWRKEY+R+Logging+Restfunctionality - untested
     v1.2-031125 - tested wdt+pwrkey+logging, reliable but slow
     v1.2-031125a - Optimizations + on-board debugger for enable/disable wdt added [untested] - redacted, 04 replaced w other logic
     *v1.2-041125a - Majorly working version. [gets blocked by cloudflare & wdt doesnt account for this]
    v1.3-121125LPE - UNTESTED - Debug b3 + wdt recover + Power management (SLEEP) + GPIO sense; BASED ON 041125a & 071125-d:11-121125
        s3-> modem starts speakin eubonics when handoff from sbc & normal btn wake doesnt work anymore like it did with s2
    24-10 todo: PWRKEY, cloudfare fix?, more testing, power states, nRF sleepstates, add-on watchdog for stuck states
    **Superstable
    *Stable
    .dts added below (bottom) as git doesn't track it

*/

/*
v1.3-121125LPE NOTE

linker.ld MIGHT NEED CONFIRMATION
if SLEEP WORKS might need attribute noinit for other vars too
    .noinit (NOLOAD) :
    {
        *(.noinit*)
    } > RAM
--->linker.ld confirmation idk tf it is im hopping off now 
*/

// ZEPHYR RTOS INCLUDES
#include <zephyr/kernel.h>
#include <zephyr/sys/printk.h>
#include <zephyr/device.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/watchdog.h>
#include <string.h>
#include <stdlib.h>

#include <zephyr/pm/device.h>
#include <hal/nrf_power.h>
#include <hal/nrf_gpio.h>


// UART CONFIGURATION
#define BAUD_RATE                   921600
#define RX_BUF_SIZE                 128
#define RESPONSE_BUF_SIZE           1024
#define RX_TIMEOUT_DELAY            500

// PWRKEY CONFIGURATION
#define PWRKEY_HIGH_MS              1075
#define PWRKEY_LOW_MS               1075
#define MODEM_RESET_HOLD_MS         13000      
#define MODEM_BOOT_HOLD_MS          1500        
#define MODEM_BOOT_WAIT_MS          10000       
#define MODEM_POST_RESET_DELAY_MS   5000 

// SERVER CONFIGURATION
#define SERVER_URL                  "seven080-mcu-backend.onrender.com"
#define SERVER_HOST                 "seven080-mcu-backend.onrender.com"
#define DEVICE_ID                   "device001"
#define POLL_INTERVAL_SEC           10

// CERT
#define CA_CERT_FILE                "server_ca.cer"
#define CA_CERT_SIZE                2048

// WATCHDOG CONFIGURATION
#define WATCHDOG_TIMEOUT_MS         30000

// DEVICE TREE REFERENCES (GPIO, UART) - pins etc
const struct device *uart0 = DEVICE_DT_GET(DT_NODELABEL(uart0)); // P0.06=TX, P0.08=RX
static const struct gpio_dt_spec button = GPIO_DT_SPEC_GET(DT_ALIAS(sw0), gpios);
static const struct gpio_dt_spec button2 = GPIO_DT_SPEC_GET(DT_ALIAS(sw1), gpios); //for pwrpin, state testing/debugging
static const struct gpio_dt_spec button3 = GPIO_DT_SPEC_GET(DT_ALIAS(sw2), gpios); // wdt customizer
static const struct gpio_dt_spec led0 = GPIO_DT_SPEC_GET(DT_ALIAS(led0), gpios); // onboard LED1
static const struct gpio_dt_spec led1 = GPIO_DT_SPEC_GET(DT_ALIAS(led1), gpios); // onboard LED2
static const struct gpio_dt_spec led2 = GPIO_DT_SPEC_GET(DT_ALIAS(led2), gpios); // onboard LED3, wdt
static const struct gpio_dt_spec trigger_pin = GPIO_DT_SPEC_GET_OR(DT_ALIAS(trigger0), gpios, {0}); // P0.11 to SBC
static const struct gpio_dt_spec sbc_handoff = GPIO_DT_SPEC_GET(DT_ALIAS(wakepin), gpios); // MCU P0.28 << P32 SBC

// Power key pin
static const struct gpio_dt_spec pwrkey_pin = GPIO_DT_SPEC_GET_OR(DT_ALIAS(trigger1), gpios, {0});
// Watchdog
static const struct device *wdt = DEVICE_DT_GET(DT_NODELABEL(wdt0));
static int wdt_channel_id;

static __attribute__((section(".noinit"))) bool was_sleeping;
static __attribute__((section(".noinit"))) uint32_t sleep_count;
static __attribute__((section(".noinit"))) uint32_t wake_count;

// STATE STRUCTURES
typedef struct {
    bool is_connected;
    bool is_session_active;
    int last_status_code;
    int last_data_size;
    bool is_shreq_received;
} http_state_t;
__attribute__((section(".noinit")))
static http_state_t http_state;

typedef struct {
    bool is_psm_enabled;
    bool is_edrx_enabled;
} power_state_t;
__attribute__((section(".noinit")))
static power_state_t power_state;

typedef struct {
    bool is_certificate_setup;
    bool is_expecting_body;
    bool is_response_complete;
    bool is_waiting_for_response;
    size_t response_length;
} uart_state_t;
