lahaan/nrf52dk-aw/src/main.c
__attribute__((section(".noinit")))
static uart_state_t uart_state;

// logging
typedef struct {
    uint32_t boot_count;
    uint32_t poll_success;
    uint32_t poll_fail;
    uint32_t handoff_count;
    uint32_t resent_count;
} device_stats_t;
__attribute__((section(".noinit")))
static device_stats_t stats; //RAM RETENTION

// SBC HANDOFF ENHANCEMENTS
static volatile bool sbc_handoff_in_progress = false;
static char pending_ack_cmd[128];
static bool pending_ack = false;

// GLOBAL STATE
//static http_state_t http_state = {0};
//static power_state_t power_state = {0};
//static uart_state_t uart_state = {0};

static bool is_start_networking = false;
static bool is_sbc_active = false;
static int packet_counter = 0;


// BUFFERS
static uint8_t rx_buffer[RX_BUF_SIZE];
static char response_buffer[RESPONSE_BUF_SIZE];
static char command_data[256];
static bool is_command_received = false;

// WORK QUEUE
static struct k_work sbc_handoff_work;
static struct k_work pwrkey_work;
static struct gpio_callback button_callback_data;
static struct gpio_callback button2_callback_data;
static struct gpio_callback sbc_handoff_cb_data;
static struct gpio_callback button3_callback_data;

// CERTIFICATE DATA

const char ca_certificate[] =
"-----BEGIN CERTIFICATE-----\n"
"MIIDejCCAmKgAwIBAgIQf+UwvzMTQ77dghYQST2KGzANBgkqhkiG9w0BAQsFADBX\n"
"MQswCQYDVQQGEwJCRTEZMBcGA1UEChMQR2xvYmFsU2lnbiBudi1zYTEQMA4GA1UE\n"
"CxMHUm9vdCBDQTEbMBkGA1UEAxMSR2xvYmFsU2lnbiBSb290IENBMB4XDTIzMTEx\n"
"NTAzNDMyMVoXDTI4MDEyODAwMDA0MlowRzELMAkGA1UEBhMCVVMxIjAgBgNVBAoT\n"
"GUdvb2dsZSBUcnVzdCBTZXJ2aWNlcyBMTEMxFDASBgNVBAMTC0dUUyBSb290IFI0\n"
"MHYwEAYHKoZIzj0CAQYFK4EEACIDYgAE83Rzp2iLYK5DuDXFgTB7S0md+8Fhzube\n"
"Rr1r1WEYNa5A3XP3iZEwWus87oV8okB2O6nGuEfYKueSkWpz6bFyOZ8pn6KY019e\n"
"WIZlD6GEZQbR3IvJx3PIjGov5cSr0R2Ko4H/MIH8MA4GA1UdDwEB/wQEAwIBhjAd\n"
"BgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDwYDVR0TAQH/BAUwAwEB/zAd\n"
"BgNVHQ4EFgQUgEzW63T/STaj1dj8tT7FavCUHYwwHwYDVR0jBBgwFoAUYHtmGkUN\n"
"l8qJUC99BM00qP/8/UswNgYIKwYBBQUHAQEEKjAoMCYGCCsGAQUFBzAChhpodHRw\n"
"Oi8vaS5wa2kuZ29vZy9nc3IxLmNydDAtBgNVHR8EJjAkMCKgIKAehhxodHRwOi8v\n"
"Yy5wa2kuZ29vZy9yL2dzcjEuY2JsMBMGA1UdIAQMMAowCAYGZ4EMAQIBMA0GCSqG\n"
"SIb3DQEBCwUAA4IBAQAYQrsPBtYDh5bjP2OBDwmkoWhIDDkic574y04tfzHpn+cJ\n"
"odI2D4SseesQ6bDrarZ7C30ddLibZatoKiws3UL9xnELz4ct92vID24FfVbiI1hY\n"
"+SW6FoVHkNeWIP0GCbaM4C6uVdF5dTUsMVs/ZbzNnIdCp5Gxmx5ejvEau8otR/Cs\n"
"kGN+hr/W5GvT1tMBjgWKZ1i4//emhA1JG1BbPzoLJQvyEotc03lXjTaCzv8mEbep\n"
"8RqZ7a2CPsgRbuvTPBwcOMBBmuFeU88+FSBX6+7iP0il8b4Z0QFqIwwMHfs/L6K1\n"
"vepuoxtGzi4CZ68zJpiq1UvSqTbFJjtbD4seiMHl\n"
"-----END CERTIFICATE-----\n";

const size_t ca_certificate_length = sizeof(ca_certificate) - 1;

// UART COMMS
static void uart_event_callback(const struct device *dev, struct uart_event *event, void *user_data);
static void handle_rx_character(char c);
static void process_line(void);
static void trim_trailing_cr(char *buffer, size_t *length);
static void parse_shreq_response(const char *line);
static void parse_shstate_response(const char *line);
static void capture_http_body_data(const char *line, size_t length);

// AT COMMAND HELPERS
void send_at_command(const char *command);
static bool send_at_and_wait_ok(const char *command, k_timeout_t timeout);

// NETWORK
bool setup_network(void);
bool setup_https_session(void);
void cleanup_http_session(void);
bool download_and_convert_certificate(void);

// HTTP HELPERS
static bool set_http_header(const char *key, const char *value);
static bool clear_http_headers(void);
static bool clear_http_parameters(void);
static bool setup_default_headers(void);
static bool http_get(const char *endpoint);
static bool http_read_data(int size);
static bool ssl_configure(const char *param, const char *value);

// POWER MANAGEMENT
bool psm_enable(uint32_t seconds_active, uint32_t seconds_periodic_tau);
bool psm_disable(void);
bool edrx_enable(uint32_t seconds_cycle);
bool edrx_disable(void);
static uint8_t encode_psm_timer(uint32_t seconds);
static const char* edrx_seconds_to_code(uint32_t seconds);

// MODEM PWRKEY
void pwrkey_work_handler(struct k_work *work);
void modem_hard_reset(void);
void pull_pwrkey_low(void);
void pull_pwrkey_high(void);
int modem_full_reset(void);

// PPP
bool end_ppp_session(void);

// COMMAND PROCESSING
void poll_for_commands(void);
void process_command(const char *response);
void execute_command(const char *command, int pin, const char *data);

// WAIT FUNCTIONS
bool wait_for_response_with_timeout(const char *expected, k_timeout_t timeout);
bool wait_for_modem_ready(int attempts, k_timeout_t per_try_timeout);
bool wait_for_ok_error(k_timeout_t timeout);

// CALLBACKS
static void button_pressed_callback(const struct device *dev, struct gpio_callback *callback, uint32_t pins);
static void button2_pressed_callback(const struct device *dev, struct gpio_callback *callback, uint32_t pins);
static void sbc_handoff_callback(const struct device *dev, struct gpio_callback *callback, uint32_t pins);
static void sbc_handoff_work_handler(struct k_work *work);
static void button3_pressed_callback(const struct device *dev, 
                                        struct gpio_callback *callback, 
                                        uint32_t pins);

// THREADS
void polling_thread(void);

// WATCHDOG
static void watchdog_feed(void);
static void watchdog_init(void);
static bool is_in_recovery = false;
int handle_watchdog_recovery(void);

//debugging-tooling for wdt
bool is_skip_wdt = false;

static volatile bool sleep_requested = false;
static volatile bool manual_sleep_trigger = false;

static void enter_system_off_sleep(void);
static void prepare_for_sleep(void);
static void wake_from_sleep(void);
static bool should_enter_sleep(void);
static void handle_sleep_wake_detection(void);
void request_sleep(void);
void trigger_manual_sleep(void);

static void init_retained_state(bool);


// UART PARSING ---------------------------------------------------------------------

static void trim_trailing_cr(char *buffer, size_t *length)
{
    if (*length > 0 && buffer[*length - 1] == '\r') {
        buffer[*length - 1] = '\0';
    }
}


static void parse_shreq_response(const char *line)
{
    char *comma1 = strchr(line, ',');
    if (comma1) {
        char *comma2 = strchr(comma1 + 1, ',');
        if (comma2) {
            http_state.last_status_code = atoi(comma1 + 1);
            http_state.last_data_size = atoi(comma2 + 1);
            printk("HTTPS Status: %d, Size: %d\n", 
                http_state.last_status_code, http_state.last_data_size);
            http_state.is_shreq_received = true;
        }
    }
}


static void parse_shstate_response(const char *line)
{
    http_state.is_session_active = (strstr(line, "+SHSTATE: 1") != NULL);
    printk("HTTPS Session State: %s\n", http_state.is_session_active ? "Connected" : "Disconnected");
}


static void capture_http_body_data(const char *line, size_t length)
{
    if (strcmp(line, "OK") != 0 &&
        strcmp(line, "ERROR") != 0 &&
        strncmp(line, "+", 1) != 0) {
        
