lahaan/nrf52dk-aw/src/main.c
        if (length < sizeof(command_data)) {
            strncpy(command_data, line, sizeof(command_data) - 1);
            command_data[sizeof(command_data) - 1] = '\0';
            is_command_received = true;
            printk("Command data captured: %s\n", command_data);
        }
    }
}


static void process_line(void)
{
    response_buffer[uart_state.response_length] = '\0';
    trim_trailing_cr(response_buffer, &uart_state.response_length);
    
    printk("<<< %s\n", response_buffer);

    if (strcmp(response_buffer, "OK") == 0) {
        uart_state.is_response_complete = true;
        uart_state.is_waiting_for_response = false;
    } 
    else if (strcmp(response_buffer, "ERROR") == 0 ||
             strstr(response_buffer, "+CME ERROR:") != NULL) {
        uart_state.is_response_complete = true;
        uart_state.is_waiting_for_response = false;
    }
    else if (strstr(response_buffer, "+SHREQ:") != NULL) {
        parse_shreq_response(response_buffer);
        uart_state.is_response_complete = true;
    }
    else if (strstr(response_buffer, "+SHSTATE:") != NULL) {
        parse_shstate_response(response_buffer);
        uart_state.is_response_complete = true;
    }
    else if (strstr(response_buffer, "+SHREAD:") != NULL) {
        // The next line will contain the actual data
    }
    else if (uart_state.is_expecting_body && uart_state.response_length > 0) {
        capture_http_body_data(response_buffer, uart_state.response_length);
    }
    
    uart_state.response_length = 0;
}

static void handle_rx_character(char c)
{
    if (c == '\n') {
        if (uart_state.response_length > 0) {
            process_line();
        }
    } else if (c != '\r') {
        if (uart_state.response_length < sizeof(response_buffer) - 1) {
            response_buffer[uart_state.response_length++] = c;
        } else {
            uart_state.response_length = 0;
        }
    }
}


static void uart_event_callback(const struct device *dev, struct uart_event *event, void *user_data)
{
    ARG_UNUSED(dev);
    ARG_UNUSED(user_data);

    switch (event->type) {
    case UART_RX_RDY: {
        const uint8_t *p = &event->data.rx.buf[event->data.rx.offset];
        size_t l = event->data.rx.len;

        for (size_t i = 0; i < l; i++) {
            handle_rx_character(p[i]);
        }
        break;
    }
    case UART_RX_DISABLED:
    case UART_RX_STOPPED:
        uart_rx_enable(uart0, rx_buffer, sizeof(rx_buffer), RX_TIMEOUT_DELAY);
        break;
    default:
        break;
    }
}

// AT COMMAND HELPERS ------------------------------------------------

void send_at_command(const char *command)
{
    if (is_sbc_active && !sbc_handoff_in_progress) {
        printk("SKIP AT CMD (SBC active): %s\n", command);
        return;
    }
    printk(">>> %s\n", command);
    for (int i = 0; command[i] != '\0'; i++) {
        uart_poll_out(uart0, command[i]);
    }
    uart_poll_out(uart0, '\r');
}

bool wait_for_ok_error(k_timeout_t timeout)
{
    uart_state.is_response_complete = false;
    uart_state.is_waiting_for_response = true;

    int64_t start = k_uptime_get();
    while (!uart_state.is_response_complete && (k_uptime_get() - start) < timeout.ticks) {
        if (is_in_recovery){
            watchdog_feed();
        }
        k_msleep(is_in_recovery ? 7 : 50); //when in recovery from wdt, use 7ms for much speedier response
    }

    if (!uart_state.is_response_complete) {
        printk("Response timeout\n");
        uart_state.is_waiting_for_response = false;
        return false;
    }

    uart_state.is_waiting_for_response = false;
    return true;
}

bool wait_for_response_with_timeout(const char *expected, k_timeout_t timeout)
{
    uart_state.response_length = 0;
    uart_state.is_response_complete = false;
    uart_state.is_waiting_for_response = true;

    int64_t start = k_uptime_get();
    while (!uart_state.is_response_complete && (k_uptime_get() - start) < timeout.ticks) {
        if (uart_state.response_length > 0 && strstr(response_buffer, expected) != NULL) {
            uart_state.is_response_complete = true;
            break;
        }
        k_msleep(50);
    }

    uart_state.is_waiting_for_response = false;
    return uart_state.is_response_complete;
}


// HTTP HELPERS ------------------------------------------------

static bool clear_http_headers(void)
{
    return send_at_and_wait_ok("AT+SHCHEAD", K_SECONDS(2));
}

static bool clear_http_parameters(void)
{
    return send_at_and_wait_ok("AT+SHCPARA", K_SECONDS(2));
}

static bool set_http_header(const char *key, const char *value)
{
    char command[128];
    snprintf(command, sizeof(command), "AT+SHAHEAD=\"%s\",\"%s\"", key, value);
    return send_at_and_wait_ok(command, K_SECONDS(2));
}

static bool setup_default_headers(void)
{
    if (!clear_http_headers() || !clear_http_parameters()) {
        return false;
    }
    if (!set_http_header("User-Agent", "nRF52-IoT-Controller")) return false;
    if (!set_http_header("Accept", "*/*")) return false;
    if (!set_http_header("Cache-control", "no-cache")) return false;
    if (!set_http_header("Connection", "keep-alive")) return false;
    if (!set_http_header("Accept-Encoding","identity")) return false; //can be removed (s3)
    return true;
}

static bool http_get(const char *endpoint)
{
    char command[128];
    snprintf(command, sizeof(command), "AT+SHREQ=\"%s\",1", endpoint);
    send_at_command(command);
    return wait_for_ok_error(K_SECONDS(30));
}

static bool http_read_data(int size)
{
    char command[40];
    snprintf(command, sizeof(command), "AT+SHREAD=0,%d", size);
    if (!send_at_and_wait_ok(command, K_SECONDS(3))) {
        return false;
    }

    int64_t start = k_uptime_get();
    while (!is_command_received && (k_uptime_get() - start) < K_SECONDS(3).ticks) {
        k_msleep(50);
    }
    return is_command_received;
}

static bool ssl_configure(const char *param, const char *value)
{
    char command[128];
    if (value) {
        snprintf(command, sizeof(command), "AT+CSSLCFG=\"%s\",1,\"%s\"", param, value);
    } else {
        snprintf(command, sizeof(command), "AT+CSSLCFG=\"%s\",1", param);
    }
    return send_at_and_wait_ok(command, K_SECONDS(3));
}

// Utility: send AT and wait for OK
static bool send_at_and_wait_ok(const char *command, k_timeout_t timeout)
{
    send_at_command(command);
    return wait_for_ok_error(timeout);
}


// NETWORK SETUP ------------------------------------------------

bool setup_network(void)
{

