lahaan/nrf52dk-aw/src/main.c
    /*
    AT+CMEE=2 - Enable verbose errors
    AT - Init, ATE0 - echo off
    AT+IPR - Set baud rate (sbc is 921600 since CATM1 7080 upload is up to 1Mbps)
    AT+GMR - Request TA revision identification of software release
    AT+CPIN? - OK if PSWD required (NOT) else WRITE (in our case it's fine)
    AT+CGREG=1 - Enable network registration unsolicitated result code
    AT+CGREG? - Check registration status (1,1 or 1,5 = registered)
    AT+CGDCONT=1,"IP","internet.telia.ee" - Define PDP context (APN)
    AT+CNACT=0,1 - Activate PDP context (APP Network Active)
    */

    watchdog_feed();
    printk("Setting up network...\n");
    if (http_state.is_session_active){
        send_at_command("AT+CGREG?");
        if (wait_for_response_with_timeout("+CGREG:", K_SECONDS(2))) {
            if (strstr(response_buffer, "+CGREG: 1,1") != NULL || strstr(response_buffer, "+CGREG: 1,5") != NULL) {
                return true;
            }
        }
        http_state.is_session_active = false;
        http_state.is_connected = false;
    }

    if (!send_at_and_wait_ok("AT+CMEE=2", K_SECONDS(2))) return false;
    if (!send_at_and_wait_ok("AT", K_SECONDS(2))) return false;
    if (!send_at_and_wait_ok("ATE0", K_SECONDS(2))) return false;
    
    char ipr_command[32];
    snprintf(ipr_command, sizeof(ipr_command), "AT+IPR=%d", BAUD_RATE);
    if (!send_at_and_wait_ok(ipr_command, K_SECONDS(2))) return false;

    if (!send_at_and_wait_ok("AT+GMR", K_SECONDS(2))) return false;
    k_sleep(K_SECONDS(1));

    send_at_command("AT+CPIN?");
    if (!wait_for_response_with_timeout("READY", K_SECONDS(2))) return false;
    
    if (!send_at_and_wait_ok("AT+CGREG=1", K_SECONDS(2))) return false;
    
    bool is_registered = false;
    for (int i = 0; i < 15; i++) {
        send_at_command("AT+CGREG?");
        if (wait_for_response_with_timeout("+CGREG: 1,1", K_SECONDS(2)) ||
            wait_for_response_with_timeout("+CGREG: 1,5", K_SECONDS(2))) {
            is_registered = true;
            break;
        }
        k_sleep(K_SECONDS(2));
    }
    
    if (!is_registered) {
        printk("Network registration failed\n");
        return false;
    }
    
    char pdp_command[80];
    snprintf(pdp_command, sizeof(pdp_command), "AT+CGDCONT=1,\"IP\",\"internet.telia.ee\"");
    if (!send_at_and_wait_ok(pdp_command, K_SECONDS(3))) return false;
    
    if (!send_at_and_wait_ok("AT+CNACT=0,1", K_SECONDS(15))) {
        send_at_command("AT+CNACT?");
        if (!wait_for_response_with_timeout("+CNACT: 0,1", K_SECONDS(2))) {
            return false;
        }
        k_sleep(K_SECONDS(2));
    }
    k_sleep(K_SECONDS(1));
    
    http_state.is_connected = true;
    printk("Network setup complete\n");
    return true;
}


// HTTPS SETUP ------------------------------------------------

bool download_and_convert_certificate(void)
{
    printk("Setting up certificate for HTTPS...\n");

    if (!send_at_and_wait_ok("AT+CFSINIT", K_SECONDS(1))) return false;
    
    char command[100];
    snprintf(command, sizeof(command), "AT+CFSDFILE=3,\"%s\"", CA_CERT_FILE);
    if (!send_at_and_wait_ok(command, K_SECONDS(1))) return false;

    snprintf(command, sizeof(command), "AT+CFSWFILE=3,\"%s\",0,%d,10000", 
             CA_CERT_FILE, (int)ca_certificate_length);
    send_at_command(command);
    k_sleep(K_SECONDS(2));

    for (size_t i = 0; i < ca_certificate_length; i++) {
        uart_poll_out(uart0, ca_certificate[i]);
    }
    k_sleep(K_SECONDS(3));

    if (!send_at_and_wait_ok("AT+CFSTERM", K_SECONDS(1))) return false;

    snprintf(command, sizeof(command), "AT+CSSLCFG=\"convert\",2,\"%s\"", CA_CERT_FILE);
    if (!send_at_and_wait_ok(command, K_SECONDS(10))) return false;

    uart_state.is_certificate_setup = true;
    return true;
}

bool setup_https_session(void)
{
    /*
    CSSLCFG: Configure SSL params of a context identifier
    AT+CSSLCFG="ignorertctime",1,1 - Ignore RTC time check (1=ignore), could also set time/ignore this (time has been set to 2025 oct 1 as of v1.0-081025)
    AT+CSSLCFG="sslversion",1,3 - Set SSL version to TLS 1.2 (3)
    AT+CSSLCFG="sni",1,"seven080-mcu-backend.onrender.com" - Set SNI
    AT+SHSSL=1,"server_ca.cer" - Use the certificate for verification
    AT+SHCONF="URL","https://seven080-mcu-backend.onrender.com" - Set URL (HTTPS)
    AT+SHCONF="BODYLEN",1024 - Set body length
    AT+SHCONF="HEADERLEN",350 - Set header length
    AT+CDNSGIP="seven080-mcu-backend.onrender.com" - Test DNS resolution
    AT+SHCONN - Connect HTTPS session [main part, can take time]
    AT+SHSTATE? - Check state (1=connected)
    7s timeout for SHCONN seems to work ok, 10s+ safer
    */

    if (http_state.is_session_active) {
        printk("HTTPS session already active\n");
        return true;
    }

    printk("Setting up HTTPS session...\n");
    cleanup_http_session();

    if (!uart_state.is_certificate_setup) {
        if (!download_and_convert_certificate()) {
            printk("FATAL: Certificate setup failed.\n");
            return false;
        }
    } else {
        printk("Certificate already installed, skipping cert download\n");
    }

    // SSL Configuration
    send_at_command("AT+CSSLCFG=\"ignorertctime\",1,1");
    if (!wait_for_ok_error(K_SECONDS(3))) return false;
    if (!ssl_configure("sslversion", "3")) return false; // TLS 1.2
    if (!ssl_configure("sni", SERVER_HOST)) return false;

    char ssl_command[80];
    snprintf(ssl_command, sizeof(ssl_command), "AT+SHSSL=1,\"%s\"", CA_CERT_FILE);
    if (!send_at_and_wait_ok(ssl_command, K_SECONDS(3))) return false;

    char url_command[128];
    snprintf(url_command, sizeof(url_command), "AT+SHCONF=\"URL\",\"https://%s\"", SERVER_URL);
    if (!send_at_and_wait_ok(url_command, K_SECONDS(3))) return false;

    if (!send_at_and_wait_ok("AT+SHCONF=\"BODYLEN\",1024", K_SECONDS(3))) return false;
    if (!send_at_and_wait_ok("AT+SHCONF=\"HEADERLEN\",350", K_SECONDS(3))) return false;

    // Optional DNS test
    send_at_command("AT+CDNSGIP=\"" SERVER_HOST "\"");
    wait_for_ok_error(K_SECONDS(10));
    k_sleep(K_SECONDS(2));

    watchdog_feed();
    if (!send_at_and_wait_ok("AT+SHCONN", K_SECONDS(20))) {
        printk("HTTPS connection failed\n");
        return false;
    }

    send_at_command("AT+SHSTATE?");
    if (!wait_for_response_with_timeout("+SHSTATE: 1", K_SECONDS(5))) {
        printk("HTTPS session not active\n");
        return false;
    }

    http_state.is_session_active = true;
    printk("HTTPS session setup complete\n");
    return true;
}

void cleanup_http_session(void)
{
    if (is_sbc_active && !sbc_handoff_in_progress) {
        printk("cleanup_http_session: SBC active - skipping AT, marking inactive\n");
        http_state.is_session_active = false;
        return;
    }

    // Full HTTP/SSL teardown
    if (http_state.is_session_active) {
        printk("Cleaning up HTTPS session...\n");
        send_at_command("AT+SHDISC");   // Disconnect
        wait_for_ok_error(K_SECONDS(5));
        http_state.is_session_active = false;
    }

