lahaan/nrf52dk-aw/src/main.c
    send_at_command("AT+SHSSL=0");
    wait_for_ok_error(K_SECONDS(2));
    send_at_command("AT+SHTRDT");
    wait_for_ok_error(K_SECONDS(2));
    send_at_command("AT+SHCHEAD");
    wait_for_ok_error(K_SECONDS(2));
    send_at_command("AT+SHCPARA"); 
    wait_for_ok_error(K_SECONDS(2));
}


// COMMAND POLLING ------------------------------------------------

void poll_for_commands(void)
{
    watchdog_feed();
    if (is_sbc_active) {
        printk("ERR: SBC ACTIVE - SKIP POLLING\n");
        return;
    }

    if (!http_state.is_session_active && !setup_https_session()) {
        printk("Failed to setup HTTPS session\n");
        return;
    }
    
    printk("Polling for commands...\n");
    
    if (!setup_default_headers()) {
        printk("ERROR: Failed to setup HTTP headers\n");
        cleanup_http_session();
        return;
    }
    
    http_state.last_status_code = 0;
    http_state.last_data_size = 0;
    http_state.is_shreq_received = false;
    
    char endpoint[100];
    snprintf(endpoint, sizeof(endpoint), "/api/poll/%s", DEVICE_ID);
    if (!http_get(endpoint)) {
        printk("HTTPS request failed or timeout\n");
        cleanup_http_session();
        return;
    }
    
    printk("Waiting for +SHREQ response...\n");
    int64_t start = k_uptime_get();
    while (!http_state.is_shreq_received && (k_uptime_get() - start) < K_SECONDS(10).ticks) {
        k_msleep(100);
    }
    
    if (!http_state.is_shreq_received) {
        printk("ERROR: +SHREQ response timeout!\n");
        return;
    }
    
    watchdog_feed();

    if (http_state.last_status_code == 200 && http_state.last_data_size > 0) {
        memset(command_data, 0, sizeof(command_data));
        is_command_received = false;
        uart_state.is_expecting_body = true;

        printk("Boutta READ packet n=%d\n", packet_counter++);
        if (packet_counter > 100000) packet_counter = 0;

        if (http_read_data(http_state.last_data_size)) {
            printk("Received command: %s\n", command_data);
            process_command(command_data);
            
            // Send acknowledgment
            char acknowledgement_url[128];
            snprintf(acknowledgement_url, sizeof(acknowledgement_url), "AT+SHREQ=\"/api/ack/%s/OK\",1", DEVICE_ID);

            if (is_sbc_active && !sbc_handoff_in_progress) {
                strncpy(pending_ack_cmd, acknowledgement_url, sizeof(pending_ack_cmd) - 1);
                pending_ack_cmd[sizeof(pending_ack_cmd) - 1] = '\0';
                pending_ack = true;
                printk("ACK queued until MCU regains modem control\n");
            } else {
                send_at_command(acknowledgement_url);
                wait_for_ok_error(K_SECONDS(7));
            }
        } else {
            printk("No command data received within timeout\n");
        }
        uart_state.is_expecting_body = false;
    } else {
        printk("No commands available (Status: %d, Size: %d)\n", 
               http_state.last_status_code, http_state.last_data_size);
    }
    
    k_msleep(500);
}


// COMMAND EXECUTION ------------------------------------------------

void process_command(const char *response)
{
    printk("Processing command: %s\n", response);

    if (strstr(response, "NOCMD") != NULL) {
        printk("No commands waiting\n");
        return;
    }

    char command[32] = {0};
    int pin = 0;
    char data[64] = {0};
    if (sscanf(response, "CMD:%31[^,],PIN:%d,DATA:%63s", command, &pin, data) == 3) {
        printk("Parsed - CMD: %s, PIN: %d, DATA: %s\n", command, pin, data);
        execute_command(command, pin, data);
    } else {
        printk("Failed to parse command string\n");
    }
}

void execute_command(const char *command, int pin, const char *data)
{
    printk("Executing: %s on pin %d\n", command, pin);
    
    if (strcmp(command, "LED_ON") == 0 && gpio_is_ready_dt(&led0)) {
        gpio_pin_set_dt(&led0, 1);
        printk("LED ON\n");
    }
    else if (strcmp(command, "LED_OFF") == 0 && gpio_is_ready_dt(&led0)) {
        gpio_pin_set_dt(&led0, 0);
        printk("LED OFF\n");
    }
    else if (strcmp(command, "TOGGLE") == 0 && gpio_is_ready_dt(&led0)) {
        gpio_pin_toggle_dt(&led0);
        printk("LED TOGGLED\n");
    }
    else if (strcmp(command, "BOOT") == 0 && gpio_is_ready_dt(&trigger_pin)) {
        printk("Triggering SBC boot sequence...\n");
        gpio_pin_set_dt(&trigger_pin, 0);
        k_sleep(K_MSEC(250));
        gpio_pin_set_dt(&trigger_pin, 1);
        is_sbc_active = true;
        printk("Boot trigger complete + SBC-active state entered\n");
    }
    else if (strcmp(command, "PULSE") == 0 && pin == 11 && gpio_is_ready_dt(&trigger_pin)) {
        gpio_pin_set_dt(&trigger_pin, 0);
        k_sleep(K_MSEC(500));
        gpio_pin_set_dt(&trigger_pin, 1);
        is_sbc_active = true;
        printk("Pulsed pin %d [SBC PIN]. SBC-active state entered\n", pin);
    }
    else if (strcmp(command, "BLINK") == 0 && gpio_is_ready_dt(&led0)) {
        int count = data[0] ? atoi(data) : 3;
        if (count <= 0) count = 3;
        for (int i = 0; i < count; i++) {
            gpio_pin_set_dt(&led0, 1);
            k_sleep(K_MSEC(200));
            gpio_pin_set_dt(&led0, 0);
            k_sleep(K_MSEC(200));
        }
        printk("Blink sequence complete (%d times)\n", count);
    }
    else if (strcmp(command, "STATUS") == 0) {
        printk("Status requested - would send telemetry here\n");
    }
    else {
        printk("Unknown command: %s\n", command);
    }
}


// POWER MANAGEMENT ------------------------------------------------

/* 
    CURRENTLY UNUSED - EXAMPLE IMPLEMENTATION ONLY
    usage:
    psm_enable(30, 3600); - enable PSM w 30s active 1h TAU
    edrx_enable(60); 60s cycle 
*/

static uint8_t encode_psm_timer(uint32_t seconds)
{
    if (seconds <= 2) return seconds;
    if (seconds <= 120 && seconds % 6 == 0) return (seconds / 6) + 2;
    if (seconds <= 1800 && seconds % 60 == 0) return (seconds / 60) + 22;
    if (seconds <= 10800 && seconds % 360 == 0) return (seconds / 360) + 52;
    if (seconds <= 31536000 && seconds % 86400 == 0) return (seconds / 86400) + 82;
    return 0;
}

