lahaan/nrf52dk-aw/src/main.c
static const char* edrx_seconds_to_code(uint32_t seconds)
{
    if (seconds <= 5) return "0000";
    if (seconds <= 10) return "0001";
    if (seconds <= 20) return "0010";
    if (seconds <= 41) return "0011";
    if (seconds <= 61) return "0100";
    if (seconds <= 82) return "0101";
    if (seconds <= 102) return "0110";
    if (seconds <= 123) return "0111";
    if (seconds <= 143) return "1000";
    if (seconds <= 164) return "1001";
    if (seconds <= 328) return "1010";
    if (seconds <= 655) return "1011";
    if (seconds <= 1311) return "1100";
    if (seconds <= 2621) return "1101";
    if (seconds <= 5243) return "1110";
    return "1111";
}

bool psm_enable(uint32_t seconds_active, uint32_t seconds_periodic_tau)
{
    uint8_t t3324 = encode_psm_timer(seconds_active);
    uint8_t t3412 = encode_psm_timer(seconds_periodic_tau);
    if (t3324 == 0 || t3412 == 0) {
        printk("PSM: Invalid timer values\n");
        return false;
    }
    char command[64];
    snprintf(command, sizeof(command), "AT+CPSMS=1,,,\"%08b\",\"%08b\"", t3412, t3324);
    if (!send_at_and_wait_ok(command, K_SECONDS(5))) {
        printk("Failed to enable PSM\n");
        return false;
    }
    power_state.is_psm_enabled = true;
    return true;
}

bool psm_disable(void)
{
    if (!send_at_and_wait_ok("AT+CPSMS=0", K_SECONDS(5))) {
        printk("Failed to disable PSM\n");
        return false;
    }
    power_state.is_psm_enabled = false;
    return true;
}

bool edrx_enable(uint32_t seconds_cycle)
{
    const char* edrx_code = edrx_seconds_to_code(seconds_cycle);
    char command[40];
    snprintf(command, sizeof(command), "AT+CEDRXS=1,4,\"%s\"", edrx_code);
    if (!send_at_and_wait_ok(command, K_SECONDS(5))) {
        printk("Failed to enable eDRX\n");
        return false;
    }
    power_state.is_edrx_enabled = true;
    return true;
}

bool edrx_disable(void)
{
    if (!send_at_and_wait_ok("AT+CEDRXS=0,4", K_SECONDS(5))) {
        printk("Failed to disable eDRX\n");
        return false;
    }
    power_state.is_edrx_enabled = false;
    return true;
}

void modem_hard_reset(void){
    if (!gpio_is_ready_dt(&pwrkey_pin)) {
        printk("Modem reset pin not ready\n");
        return;
    }

    printk("Performing modem hard reset...\n");
    gpio_pin_set_dt(&pwrkey_pin, 1);
    k_sleep(K_MSEC(PWRKEY_HIGH_MS)); //minimum 1000ms, +75ms to be safe (1-12s)
    gpio_pin_set_dt(&pwrkey_pin, 0);
    k_sleep(K_SECONDS(3)); // wait for modem to shutdown
    gpio_pin_set_dt(&pwrkey_pin, 1);
    k_sleep(K_MSEC(PWRKEY_HIGH_MS));
    gpio_pin_set_dt(&pwrkey_pin, 0);
    k_sleep(K_SECONDS(3)); // wait for modem to startup
    stats.boot_count++;
    printk("Modem reboot complete\n");
}

void pull_pwrkey_low(void){
    if (!gpio_is_ready_dt(&pwrkey_pin)) {
        printk("PWRKEY pin not ready\n");
        return;
    }
    gpio_pin_set_dt(&pwrkey_pin, 0);
    k_sleep(K_MSEC(PWRKEY_LOW_MS));
    gpio_pin_set_dt(&pwrkey_pin, 1);
    k_sleep(K_MSEC(5000));
    printk("PWRKEY PULSED LOW\n");
}

void pull_pwrkey_high(void){ //likely for boot
    if (!gpio_is_ready_dt(&pwrkey_pin)) {
        printk("PWRKEY pin not ready\n");
        return;
    }
    gpio_pin_set_dt(&pwrkey_pin, 1);
    k_sleep(K_MSEC(PWRKEY_HIGH_MS));
    gpio_pin_set_dt(&pwrkey_pin, 0);
    k_sleep(K_MSEC(5000));
    printk("PWRKEY PULSED HIGH\n");
}


void pwrkey_work_handler(struct k_work *work) {
    ARG_UNUSED(work);
    pull_pwrkey_high();
}


int modem_full_reset(void) {
    if (!gpio_is_ready_dt(&pwrkey_pin)) {
        printk("Modem reset pin not ready\n");
        return 1;
    }

    watchdog_feed();
    stats.boot_count++;
    printk("Boot attempt #%u\n", stats.boot_count);

    printk("Performing full modem reset...\n");
    gpio_pin_set_dt(&pwrkey_pin, 1);
    k_sleep(K_MSEC(13000));
    gpio_pin_set_dt(&pwrkey_pin, 0);
    k_sleep(K_SECONDS(5)); // allow modem to settle
    send_at_command("AT");
    if (wait_for_ok_error(K_SECONDS(5))) {
        printk("Modem full reset complete and responsive\n");
        return 0;
    }

    printk("ERROR: Modem NOT RESPONSIVE after FULL RESET, attempting boot sequence...\n");

    watchdog_feed();
    gpio_pin_set_dt(&pwrkey_pin, 1);
    k_sleep(K_MSEC(1500));
    gpio_pin_set_dt(&pwrkey_pin, 0);
    k_sleep(K_SECONDS(5));

    send_at_command("AT");
    if (wait_for_ok_error(K_SECONDS(5))) {
        printk("Modem BOOT SUCCESS after fallback!\n");
        return 0;
    }

    watchdog_feed();
    printk("Trying hard reset [REBOOT]\n");
    modem_hard_reset();
    send_at_command("AT");
    if (wait_for_ok_error(K_SECONDS(5))) {
        printk("Modem RECOVERED\n");
        return 0;
    } else {
        printk("CRITICAL FAILURE: Modem FAILED after all recovery attempts\n");
    }

    printk("LOG: boot_count=%u, poll_success=%u, poll_fail=%u, handoff_count=%u, resent_count=%u\n",
           stats.boot_count, stats.poll_success, stats.poll_fail,
           stats.handoff_count, stats.resent_count);
    return 1;
}



// PPP & SBC HANDOFF ------------------------------------------------

bool wait_for_modem_ready(int attempts, k_timeout_t per_try_timeout)
{
    for (int i = 0; i < attempts; i++) {
        if (is_sbc_active && !sbc_handoff_in_progress) {
            printk("wait_for_modem_ready abort: SBC active\n");
            return false;
        }
        send_at_command("AT");
        if (wait_for_ok_error(per_try_timeout)) {
            printk("Modem ready (AT -> OK)\n");
            return true;
        }
        printk("Modem not ready yet (attempt %d/%d). Retrying...\n", i+1, attempts);
        k_msleep(200 + (i * 100));
    }
    return false;
}

bool end_ppp_session(void)
{
    watchdog_feed();
    printk("Ending PPP session...\n");
    k_sleep(K_MSEC(1100));
    uart_poll_out(uart0, '+');
    uart_poll_out(uart0, '+');
    uart_poll_out(uart0, '+');
    k_sleep(K_MSEC(3000)); // <-- increased from 1100 to 3000 ms

    if (!wait_for_ok_error(K_SECONDS(5))) {
        printk("FAILED TO STOP PPP\n");
        return false;
    }
    printk("PPP escape successful\n");

