lahaan/nrf52dk-aw/src/main.c
    send_at_command("ATH");
    if (!wait_for_ok_error(K_SECONDS(2))) {
        printk("Failed to hang up data call\n");
        return false;
    }

    http_state.is_connected = false;
    http_state.is_session_active = false;
    return true;
}

static void sbc_handoff_work_handler(struct k_work *work)
{
    ARG_UNUSED(work);
    k_msleep(100); // debounce

    int val = gpio_pin_get_dt(&sbc_handoff);
    printk("SBC handoff work handler (pin=%d)\n", val);

    if (val) {
        // SBC became active → relinquish
        is_sbc_active = true;
        sbc_handoff_in_progress = false;
        printk("SBC ACTIVE → MCU cleans up\n");
        cleanup_http_session();
        return;
    }

    // SBC handed off → MCU resumes
    printk("SBC handed off → MCU resuming control\n");
    stats.handoff_count++;
    sbc_handoff_in_progress = true;
    is_sbc_active = false;

    // Re-enable UART if needed (optional but safe)
    uart_rx_enable(uart0, rx_buffer, sizeof(rx_buffer), RX_TIMEOUT_DELAY);

    // Retry PPP termination up to 4 times
    bool ended = false;
    for (int attempt = 0; attempt < 4; attempt++) {
        if (end_ppp_session()) {
            ended = true;
            break;
        }
        printk("PPP end attempt %d failed, retrying...\n", attempt + 1);
        k_msleep(300 + (attempt * 200));
    }

    if (!ended) {
        printk("Warning: PPP end failed; proceeding anyway\n");
    }

    k_sleep(K_MSEC(500));

    // Ensure modem is responsive
    if (!wait_for_modem_ready(5, K_SECONDS(2))) {
        printk("Modem unresponsive – resetting via PWRKEY\n");
        modem_hard_reset();
        if (!wait_for_modem_ready(10, K_SECONDS(3))) {
            printk("Modem still dead after reset\n");
            return;
        }
    }

    k_sleep(K_MSEC(500));

    // Re-establish HTTPS
    if (!setup_https_session()) {
        printk("HTTPS setup failed after handoff\n");
    }

    // Send pending ACK if any
    if (pending_ack && !is_sbc_active) {
        printk("Sending pending ACK: %s\n", pending_ack_cmd);
        send_at_command(pending_ack_cmd);
        wait_for_ok_error(K_SECONDS(7));
        pending_ack = false;
    }

    sbc_handoff_in_progress = false;
}


// INTERRUPT CALLBACKS ------------------------------------------------

static void button_pressed_callback(const struct device *dev, struct gpio_callback *callback, uint32_t pins)
{
    ARG_UNUSED(dev); ARG_UNUSED(callback); ARG_UNUSED(pins);
    printk("Button pressed! Starting communication test...\n");
    is_start_networking = true;
}

static void sbc_handoff_callback(const struct device *dev, 
                                 struct gpio_callback *callback, 
                                 uint32_t pins)
{
    ARG_UNUSED(dev); 
    ARG_UNUSED(callback); 
    ARG_UNUSED(pins);
    
    int pin_state = gpio_pin_get_dt(&sbc_handoff);
    
    if (pin_state == 1) {
        // SBC became active (pin went HIGH)
        printk("SBC handoff IRQ: SBC taking control (pin HIGH)\n");
        is_sbc_active = true;
        sbc_handoff_in_progress = false;
        
        // Request sleep after brief delay
        printk("Scheduling sleep in 1 second...\n");
        // Could use a work queue here for delayed sleep
        request_sleep();
        
    } else {
        // SBC handed off (pin went LOW) - MCU should wake
        printk("SBC handoff IRQ: SBC releasing control (pin LOW)\n");
        printk("Scheduling handoff work\n");
        k_work_submit(&sbc_handoff_work);
    }
}

static void button2_pressed_callback(const struct device *dev, struct gpio_callback *callback, uint32_t pins)
{
    ARG_UNUSED(dev); ARG_UNUSED(callback); ARG_UNUSED(pins);
    printk("Button2 pressed! PWRKEY-TEST\n");
    k_work_submit(&pwrkey_work);
}


// THREADS ------------------------------------------------

void polling_thread(void)
{
    printk("Starting polling thread...\n");
    
    while (!is_start_networking) {
        if (should_enter_sleep()) {
            enter_system_off_sleep();
        }
        k_sleep(K_MSEC(100));
    }
    
    // Check if this is a wake event
    bool is_wake_event = (wake_count > 0 && sleep_count > 0);
    
    if (is_wake_event) {
        printk("=== WAKE EVENT #%u - SMART RESUME ===\n", wake_count);
        
        watchdog_feed();
        
        // FAST PATH: Try retained session
        if (http_state.is_session_active) {
            printk("Attempting instant resume with retained session...\n");
            
            // Quick modem check
            // clears pppd
            k_sleep(K_MSEC(1100));
            uart_poll_out(uart0, '+');
            uart_poll_out(uart0, '+');
            uart_poll_out(uart0, '+');
            wait_for_ok_error(K_MSEC(1500));
            send_at_command("AT");
            if (wait_for_ok_error(K_SECONDS(2))) {
                // Verify HTTPS session
                send_at_command("AT+SHSTATE?");
                if (wait_for_response_with_timeout("+SHSTATE: 1", K_SECONDS(2))) {
                    printk("HTTPS SESSION RETAINED - INSTANT RESUME!\n");
                    goto resume_polling; // Skip full setup
                }
            }
            printk("✗ Session lost - full reconnection needed\n");
        }

        // SLOW PATH: Full reconnection
        printk("Performing full reconnection...\n");
        http_state.is_session_active = false;
        http_state.is_connected = false;
        
        watchdog_feed();
        
        if (!setup_network()) {
            printk("Network setup failed after wake!\n");
            return;
        }
        
        watchdog_feed();
        
        if (!setup_https_session()) {
            printk("HTTPS setup failed after wake!\n");
            return;
        }
        
    } else {
        // First boot - button triggered
        printk("Button triggered networking start!\n");
        
        watchdog_feed();
        
        if (!setup_network()) {
            printk("Network setup failed!\n");
            return;
        }
    }
    
