lahaan/nrf52dk-aw/src/main.c
resume_polling:
    printk("=== ENTERING POLLING LOOP ===\n");
    
    // Normal polling loop
    while (1) {
        if (should_enter_sleep()) {
            printk("Sleep condition detected - entering sleep in 2s\n");
            k_sleep(K_SECONDS(2));
            
            if (should_enter_sleep()) {
                enter_system_off_sleep();
            } else {
                printk("Sleep condition cleared during delay\n");
            }
        }
        
        if (!is_sbc_active) {
            poll_for_commands();
            k_sleep(K_SECONDS(POLL_INTERVAL_SEC));
            (http_state.last_status_code == 200) ? stats.poll_success++ : stats.poll_fail++;
        } else {
            watchdog_feed();
            printk("SBC active - MCU idle\n");
            k_sleep(K_SECONDS(5));
        }
    }
}


// WATCHDOG ------------------------------------------------

static void watchdog_feed(void)
{   
    if (wdt && device_is_ready(wdt)) {
        wdt_feed(wdt, wdt_channel_id);
    }
}

static void watchdog_init(void)
{
    if (!device_is_ready(wdt)) {
        printk("Watchdog device not ready\n");
        return;
    }

    struct wdt_timeout_cfg wdt_config = {
        .window.min = 0U,
        .window.max = WATCHDOG_TIMEOUT_MS,
        .flags = WDT_FLAG_RESET_SOC,
        .callback = NULL
    };

    wdt_channel_id = wdt_install_timeout(wdt, &wdt_config);
    if (wdt_channel_id < 0) {
        printk("Failed to install watchdog timeout: %d\n", wdt_channel_id);
        return;
    }
    
    int error = wdt_setup(wdt, 0);
    if (error < 0) {
        printk("Failed to setup watchdog: %d\n", error);
        return;
    }

    printk("Watchdog started: [T: %dms]\n", WATCHDOG_TIMEOUT_MS);
}


int handle_watchdog_recovery(void)
{
    printk("INITIATING WDT RECOVERY\n");
    is_in_recovery = true;

    if (wait_for_modem_ready(2, K_SECONDS(1))) {    // wait for modem to respond
        http_state.is_session_active = false;
        memset(response_buffer, 0, sizeof(response_buffer)); //CAN REMOVE ! experimental 
        uart_state.response_length = 0;                      //CAN REMOVE ! experimental 
        send_at_command("AT+SHSTATE?");     // check if HTTPS is plausible
        
        int64_t start = k_uptime_get();

        /*
        due to cloudflare being annoying and not configurable for prototyping, at least on free plan or / if not self/local hosting, 
        can remove this SHSTATE check (or keep) & just force reboot when it says that it's SHSTATE = 1 &or says SHSTATE = 1 after +++ (pppd)
        OR check SHCONN message(s) instead of just wait_for_ok, but also for str starting with cloudfare (or garbage) and then insta-force reboot / poweroff
        on modem which in return will trigger WDT for MCU in <30s, automatically setting up the system successfully again. 
        */
       
        while ((k_uptime_get() - start) < K_SECONDS(3).ticks) {
            if (strstr(response_buffer, "+SHSTATE:") != NULL) {
                break; 
            }
            k_msleep(20);
            watchdog_feed();
        }

        if (http_state.is_session_active) {
            printk("HTTPS session intact — resuming\n");
        }
        return 0;
    }

    watchdog_feed();
    printk("Modem unresponsive — trying PPP escape (+++)\n");
    //sending +++ as modem might be in PPP mode (mode SBC uses), +++ cancels it and enables AT commands
    k_sleep(K_MSEC(1100));
    uart_poll_out(uart0, '+');
    uart_poll_out(uart0, '+');
    uart_poll_out(uart0, '+');
    if (wait_for_ok_error(K_MSEC(1400))) { //if +++ responds with OK it's most certainly back from PPP and will have certs
        printk("PPP escape succeeded\n");
        uart_state.is_certificate_setup = true;
        return 0;
    }

    // None work, modem likely powered off or hung

    printk("PPP escape failed — toggling PWRKEY\n"); 
    watchdog_feed();
    pull_pwrkey_high();
    if (send_at_and_wait_ok("AT", K_SECONDS(1))) {
        printk("Modem RESPONSIVE after PWRKEY TOGGLE\n");
        return 0;
    }
    
    watchdog_feed();
    modem_hard_reset();
    if (send_at_and_wait_ok("AT", K_SECONDS(3))) {
        printk("Modem RESPONSIVE after HARD REBOOT\n");
        return 0;
    }

    printk("Modem STILL UNRESPONSIVE — performing FULL FACTORY RESET - WAITING 15 SECONDS - REBOOT NRF TO CANCEL\n");
    watchdog_feed();
    k_sleep(K_SECONDS(15));
    return modem_full_reset();
}


// SLEEP FUNCTIONALITY -----------------------------

static void prepare_for_sleep(void)
{
    printk("\n    PREPARING FOR SLEEP    \n");
    printk("Sleep count: %u, Wake count: %u\n", sleep_count + 1, wake_count);
    
    // Mark that we're going to sleep
    was_sleeping = true;
    sleep_count++;
    
    // Disable watchdog if it's running (can't run in System OFF)
    if (!is_skip_wdt && wdt && device_is_ready(wdt)) {
        wdt_disable(wdt);
        printk("WDT disabled\n");
    }
    
    // Suspend UART
    if (device_is_ready(uart0)) {
        pm_device_action_run(uart0, PM_DEVICE_ACTION_SUSPEND);
        printk("UART suspended\n");
    }
    
    // Turn off all LEDs for power saving
    gpio_pin_set_dt(&led0, 0);
    gpio_pin_set_dt(&led1, 0);
    gpio_pin_set_dt(&led2, 0);
    
    // Allow UART to flush
    k_sleep(K_MSEC(100));
    
    printk("Sleep preparation complete\n");
}


static void wake_from_sleep(void)
{
    wake_count++;
    
    printk("   WAKE FROM SYSTEM OFF DETECTED   \n");
    printk("Sleep sessions: %u, Wake events: %u\n", sleep_count, wake_count);
    
    // Resume UART with async RX
    if (device_is_ready(uart0)) {
        pm_device_action_run(uart0, PM_DEVICE_ACTION_RESUME);
        uart_rx_enable(uart0, rx_buffer, sizeof(rx_buffer), RX_TIMEOUT_DELAY);
        printk("UART resumed\n");
    }
    
    // Re-initialize watchdog if it wasn't disabled at boot
    if (!is_skip_wdt) {
        watchdog_init();
    } else {
        printk("WDT remains disabled (debug mode)\n");
    }
    
    // Visual feedback - blink LED1
    for (int i = 0; i < 3; i++) {
        gpio_pin_set_dt(&led1, 1);
        k_sleep(K_MSEC(100));
        gpio_pin_set_dt(&led1, 0);
        k_sleep(K_MSEC(100));
    }
    
    // Reset sleep flags
    was_sleeping = false;
    sleep_requested = false;
    manual_sleep_trigger = false;

