lahaan/nrf52dk-aw/src/main.c
    is_start_networking = true;
    
    printk("Wake sequence complete - resuming normal operation\n\n");
    printk("Retained session state: HTTP=%d, Certs=%d\n", http_state.is_session_active, uart_state.is_certificate_setup);
}


static void enter_system_off_sleep(void)
{
    printk("  ENTERING SYSTEM OFF SLEEP MODE   \n");
    
    prepare_for_sleep();
    
    // Configure P0.28 (sbc_handoff) as wake source
    // Wake when pin goes LOW (SBC hands off control)
    nrf_gpio_cfg_sense_input(sbc_handoff.pin, 
                            NRF_GPIO_PIN_PULLUP, 
                            NRF_GPIO_PIN_SENSE_LOW);
    
    printk("GPIO wake configured: P0.%d (sense LOW)\n", sbc_handoff.pin);
    
    // RAM RETENTION YIWAUYGDIYGAWFOUYGAWFYUGAWFUYGAWYUFGAWIYUDKAJWHCXKJAWSHDKJH
    // Retain first 32KB (blocks 0-3) for var
    for (int i = 0; i < 4; i++) {
        NRF_POWER->RAM[i].POWERSET = 0xFFFFFFFF;
    }
    printk("RAM retention configured (32KB)\n");
    
    // Final delay before sleep
    k_sleep(K_MSEC(50));
    
    printk("Entering System OFF NOW...\n");
    
    // Enter System OFF - this does not return
    // Device will reset when P0.28 goes LOW
    nrf_power_system_off(NRF_POWER);
    
    // Never reached
    CODE_UNREACHABLE;
}


static bool should_enter_sleep(void)
{
    // Manual sleep trigger (button press)
    if (manual_sleep_trigger) {
        printk("Manual sleep trigger detected\n");
        return true;
    }
    
    // Auto-sleep when SBC is active
    if (is_sbc_active && !sbc_handoff_in_progress) {
        int pin_state = gpio_pin_get_dt(&sbc_handoff);
        if (pin_state == 1) { // SBC holding pin HIGH
            printk("SBC active (pin HIGH) - auto-sleep condition met\n");
            return true;
        }
    }
    
    return false;
}


static void handle_sleep_wake_detection(void)
{
    uint32_t reset_reason = nrf_power_resetreas_get(NRF_POWER);
    bool is_cold_boot = true;
    
    // Check if waking from System OFF
    if (reset_reason & NRF_POWER_RESETREAS_OFF_MASK) {
        printk("RESETREAS: System OFF wake detected (0x%08X)\n", reset_reason);
        
        if (was_sleeping) {
            // This was an intentional sleep, not a cold boot
            is_cold_boot = false;
            wake_from_sleep();
        } else {
            // Unexpected System OFF - could be power loss
            printk("WARNING: System OFF without sleep flag set\n");
            printk("Possible power loss or unintended reset\n");
            sleep_count = 0;
            wake_count = 0;
        }
        
        // Clear reset reason
        nrf_power_resetreas_clear(NRF_POWER, 0xFFFFFFFF);
    } else {
        // Normal boot (not from System OFF)
        printk("RESETREAS: Cold boot (0x%08X)\n", reset_reason);
        was_sleeping = false;
        sleep_count = 0;
        wake_count = 0;
    }
    init_retained_state(is_cold_boot);
}


void request_sleep(void)
{
    printk("Sleep requested\n");
    sleep_requested = true;
}

void trigger_manual_sleep(void)
{
    printk("Manual sleep trigger activated\n");
    manual_sleep_trigger = true;
}


static void button3_pressed_callback(const struct device *dev, 
                                     struct gpio_callback *callback, 
                                     uint32_t pins)
{
    ARG_UNUSED(dev); 
    ARG_UNUSED(callback); 
    ARG_UNUSED(pins);
    
    printk("SW3 pressed - triggering manual sleep in 2 seconds...\n");
    printk("(Press SW0 to cancel by starting networking)\n");
    trigger_manual_sleep();
}

static void init_retained_state(bool is_cold_boot){
    if (is_cold_boot){
        printk("Cold boot retained state init\n");
        memset(&http_state, 0, sizeof(http_state));
        memset(&power_state, 0, sizeof(power_state));
        memset(&uart_state, 0, sizeof(uart_state)); //s3 good fix to have
    } else {
        printk("Wake from sleep - retained state preserved\n");
        printk("  HTTP: connected=%d, session_active=%d\n", http_state.is_connected, http_state.is_session_active);
        printk("  UART: cert_setup=%d\n", uart_state.is_certificate_setup);
        printk("  Power: psm=%d, edrx=%d\n", power_state.is_psm_enabled, power_state.is_edrx_enabled);
    }
}

K_THREAD_DEFINE(polling_tid, 4096, polling_thread, NULL, NULL, NULL, 7, 0, 0);


int main(void)
{

    if (gpio_is_ready_dt(&led2)) gpio_pin_configure_dt(&led2, GPIO_OUTPUT_INACTIVE);
    if (gpio_is_ready_dt(&button3)) {
        gpio_pin_set_dt(&led2, 1);
        gpio_pin_configure_dt(&button3, GPIO_INPUT | GPIO_PULL_UP);
        printk("Press B3 to disable watchdog\n");

        for (int i = 0; i < 30; i++) {
            if (gpio_pin_get_dt(&button3)) { // active low
                is_skip_wdt = true;
                break;
            }
            k_sleep(K_MSEC(100));
        }
    }

    gpio_pin_set_dt(&led2, 0);

    handle_sleep_wake_detection();

    if (!is_skip_wdt) watchdog_init();
    else printk("DEBUG MODE [WDT DISABLED MANUALLY]\n");

    uint32_t rr = NRF_POWER->RESETREAS;
    if (rr & POWER_RESETREAS_DOG_Msk) printk("WDT RESET DETECTED");

    printk("IoT Controller Starting...\n");
    k_work_init(&sbc_handoff_work, sbc_handoff_work_handler);
    k_work_init(&pwrkey_work, pwrkey_work_handler);

    if (!device_is_ready(uart0)) {
        printk("UART not ready!\n");
        return 0;
    }

    uart_callback_set(uart0, uart_event_callback, NULL);
    if (uart_rx_enable(uart0, rx_buffer, sizeof(rx_buffer), RX_TIMEOUT_DELAY)) {
        printk("Failed to enable UART RX\n");
        return 0;
    }

    // Configure LEDs
    if (gpio_is_ready_dt(&led0)) gpio_pin_configure_dt(&led0, GPIO_OUTPUT_INACTIVE);
    if (gpio_is_ready_dt(&led1)) gpio_pin_configure_dt(&led1, GPIO_OUTPUT_INACTIVE);

    // Configure trigger pin
    if (gpio_is_ready_dt(&trigger_pin)) {
        gpio_pin_configure_dt(&trigger_pin, GPIO_OUTPUT_INACTIVE);
        gpio_pin_set_dt(&trigger_pin, 1); // default high
    }

    // Button
    if (gpio_is_ready_dt(&button)) {
        gpio_pin_configure_dt(&button, GPIO_INPUT | GPIO_PULL_UP);
        gpio_pin_interrupt_configure_dt(&button, GPIO_INT_EDGE_TO_ACTIVE);
        gpio_init_callback(&button_callback_data, button_pressed_callback, BIT(button.pin));
        gpio_add_callback(button.port, &button_callback_data);
        printk("Button configured with interrupt\n");
    }

